OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic12lf1552.h
#define ADON                    AADCON0bits.ADON                // bit 0
#define GO_NOT_DONE             AADCON0bits.GO_NOT_DONE         // bit 1
#define CHS0                    AADCON0bits.CHS0                // bit 2
#define CHS1                    AADCON0bits.CHS1                // bit 3
#define CHS2                    AADCON0bits.CHS2                // bit 4
#define CHS3                    AADCON0bits.CHS3                // bit 5
#define CHS4                    AADCON0bits.CHS4                // bit 6

#define ADPREF0                 AADCON1bits.ADPREF0             // bit 0
#define ADPREF1                 AADCON1bits.ADPREF1             // bit 1
#define ADCS0                   AADCON1bits.ADCS0               // bit 4
#define ADCS1                   AADCON1bits.ADCS1               // bit 5
#define ADCS2                   AADCON1bits.ADCS2               // bit 6
#define ADFM                    AADCON1bits.ADFM                // bit 7

#define TRIGSEL0                AADCON2bits.TRIGSEL0            // bit 4
#define TRIGSEL1                AADCON2bits.TRIGSEL1            // bit 5
#define TRIGSEL2                AADCON2bits.TRIGSEL2            // bit 6

#define ADDSEN                  AADCON3bits.ADDSEN              // bit 0
#define ADIPEN                  AADCON3bits.ADIPEN              // bit 1
#define ADOOEN                  AADCON3bits.ADOOEN              // bit 3
#define ADOEN                   AADCON3bits.ADOEN               // bit 4
#define ADIPPOL                 AADCON3bits.ADIPPOL             // bit 6
#define ADEPPOL                 AADCON3bits.ADEPPOL             // bit 7

#define GRDPOL                  AADGRDbits.GRDPOL               // bit 5
#define GRDAOE                  AADGRDbits.GRDAOE               // bit 6
#define GRDBOE                  AADGRDbits.GRDBOE               // bit 7

#define ADPRE0                  AADPREbits.ADPRE0               // bit 0
#define ADPRE1                  AADPREbits.ADPRE1               // bit 1
#define ADPRE2                  AADPREbits.ADPRE2               // bit 2
#define ADPRE3                  AADPREbits.ADPRE3               // bit 3
#define ADPRE4                  AADPREbits.ADPRE4               // bit 4
#define ADPRE5                  AADPREbits.ADPRE5               // bit 5
#define ADPRE6                  AADPREbits.ADPRE6               // bit 6

#define ADSTG0                  AADSTATbits.ADSTG0              // bit 0
#define ADSTG1                  AADSTATbits.ADSTG1              // bit 1
#define ADCONV                  AADSTATbits.ADCONV              // bit 2

#define ANSA0                   ANSELAbits.ANSA0                // bit 0
#define ANSA1                   ANSELAbits.ANSA1                // bit 1
#define ANSA2                   ANSELAbits.ANSA2                // bit 2
#define ANSA4                   ANSELAbits.ANSA4                // bit 4
#define ANSA5                   ANSELAbits.ANSA5                // bit 5

#define SDSEL                   APFCONbits.SDSEL                // bit 4
#define SSSEL                   APFCONbits.SSSEL                // bit 5, shadows bit in APFCONbits
#define SS1SEL                  APFCONbits.SS1SEL               // bit 5, shadows bit in APFCONbits
#define SDOSEL                  APFCONbits.SDOSEL               // bit 6, shadows bit in APFCONbits
#define SDO1SEL                 APFCONbits.SDO1SEL              // bit 6, shadows bit in APFCONbits

#define BORRDY                  BORCONbits.BORRDY               // bit 0
#define BORFS                   BORCONbits.BORFS                // bit 6
#define SBOREN                  BORCONbits.SBOREN               // bit 7

#define BSR0                    BSRbits.BSR0                    // bit 0
#define BSR1                    BSRbits.BSR1                    // bit 1
#define BSR2                    BSRbits.BSR2                    // bit 2
#define BSR3                    BSRbits.BSR3                    // bit 3
#define BSR4                    BSRbits.BSR4                    // bit 4

#define ADFVR0                  FVRCONbits.ADFVR0               // bit 0
#define ADFVR1                  FVRCONbits.ADFVR1               // bit 1
#define TSRNG                   FVRCONbits.TSRNG                // bit 4
#define TSEN                    FVRCONbits.TSEN                 // bit 5
#define FVRRDY                  FVRCONbits.FVRRDY               // bit 6
#define FVREN                   FVRCONbits.FVREN                // bit 7

#define IOCIF                   INTCONbits.IOCIF                // bit 0
#define INTF                    INTCONbits.INTF                 // bit 1
#define TMR0IF                  INTCONbits.TMR0IF               // bit 2, shadows bit in INTCONbits
#define T0IF                    INTCONbits.T0IF                 // bit 2, shadows bit in INTCONbits
#define IOCIE                   INTCONbits.IOCIE                // bit 3
#define INTE                    INTCONbits.INTE                 // bit 4
#define TMR0IE                  INTCONbits.TMR0IE               // bit 5, shadows bit in INTCONbits
#define T0IE                    INTCONbits.T0IE                 // bit 5, shadows bit in INTCONbits
#define PEIE                    INTCONbits.PEIE                 // bit 6
#define GIE                     INTCONbits.GIE                  // bit 7

#define IOCAF0                  IOCAFbits.IOCAF0                // bit 0
#define IOCAF1                  IOCAFbits.IOCAF1                // bit 1
#define IOCAF2                  IOCAFbits.IOCAF2                // bit 2
#define IOCAF3                  IOCAFbits.IOCAF3                // bit 3
#define IOCAF4                  IOCAFbits.IOCAF4                // bit 4
#define IOCAF5                  IOCAFbits.IOCAF5                // bit 5

#define IOCAN0                  IOCANbits.IOCAN0                // bit 0
#define IOCAN1                  IOCANbits.IOCAN1                // bit 1
#define IOCAN2                  IOCANbits.IOCAN2                // bit 2
#define IOCAN3                  IOCANbits.IOCAN3                // bit 3
#define IOCAN4                  IOCANbits.IOCAN4                // bit 4
#define IOCAN5                  IOCANbits.IOCAN5                // bit 5

